{
    "name": "streamtuner2",
    "title": "streamtuner2",
    "description": "Streamtuner2 is an internet radio browser. It utilizes various directory services like Shoutcast, Xiph, InternetRadio, SurfMusik, MyOggRadio, iCast, or Jamendo and Youtube to present categorized streaming stations. It chains to installed audio players like Audacious or VLC, uses streamripper for recording, but also allows bookmarking, exporting and easy searching.",
    "homepage": "http://milki.include-once.org/streamtuner2/",
    "license": "Public Domain",
    "tags": "music, internet-radio, desktop, gtk, python",
    "image": "http://milki.include-once.org/streamtuner2/screenshot.mini.png",
    "urls": {
        "fossil": "http://fossil.include-once.org/streamtuner2/",
        "src": "http://milki.include-once.org/streamtuner2/streamtuner2-$version.src.txz",
        "deb": "http://milki.include-once.org/streamtuner2/streamtuner2-$version.deb",
        "rpm": "http://milki.include-once.org/streamtuner2/streamtuner2-$version.rpm",
        "pyz": "http://milki.include-once.org/streamtuner2/streamtuner2-$version.pyz",
        "bin": "http://milki.include-once.org/streamtuner2/streamtuner2-$version.bin.txz",
        "exe": "http://milki.include-once.org/streamtuner2/streamtuner2-$version.exe"
    },
    "releases": [
        {
            "version": "2.1.6",
            "state": "beta",
            "scope": "minor bugfix",
            "changes": "The action module has been completely restructured. It now supports playlist rewriting, better heuristics, XSPF, JSPF, ASX, SMIL formats. Along with that a category playlist export function was bundled, and the Save-As dialog reworked. A new SomaFM channel was bundled, and user agent switcher plugin added. Fixes for the bookmarks channel, cache search, plugin lookup code were applied. Startup is faster again, but plugins now initialize on selection first. Which makes the category association exacter after restarts. More code cleanup and restructuring, GUI updates, command line flag handling. Still a beta release.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2015-04-13T01:30:00+0000"
        },
        {
            "version": "2.1.5",
            "state": "beta",
            "scope": "major cleanup",
            "changes": "This is a beta release, with lots of cleanups and various bugfixes. Adds a self-contained PYZ package, which Python can run directly. Now fully utilizes the plugin meta data scheme for default settings, discovery, and to reduce internal complexity. A new channel plugin for Radio-Browser.info has been bundled. Another plugin for interfacing with RadioTray was introduced, to share bookmarks via DBUS once RadioTray implements it. Notebook tabs are now on the left per default, and can be rearranged directly in the GUI. The configuration dialog now indicates the availability of selected audio players. Default audio players are now automatically configured during the first startup. Gtk properties are now utilized more over internal UI state vars. The the GtkBuilder UI file is now compressed, the Gtk2 fallback removed. The former channel icon PNGs are now embedded. Theme configuration was removed. Category retrieval became more resilient. HTTP timeouts have been added. The bookmarks tab, settings window, search dialog, stream inspector/editor have been externalized into plugins; yet remain core features. The packaging layout has been slightly restructured - to support relocatable installations (for PyZIP package). Minor fixes to youtube, internet_radio, punkcast, timer and other plugins. Help pages have been updated further, as well as CREDITS, README and general PACKAGING infos, and most plugin short descriptions. The project wiki now contains a more details on plugin APIs.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2015-04-05T22:30:00+0000"
        },
        {
            "version": "2.1.4",
            "state": "stable",
            "scope": "minor feature",
            "changes": "Fixed Internet-Radio extraction. Added basic TuneIn channel. Removed Dirble and MusicGoal channels. Fix desktop and packaging infos according to Debian guidelines. Switch to fpm/xml for package building. Remove bundled requests library. Update icon and fix path to application logo. Minor documentation updates.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2015-03-25T00:30:00+0000"
        },
        {
            "version": "2.1.3",
            "state": "stable",
            "scope": "minor bugfix",
            "changes": "A new plugin for Dirble.com radio listings was introduced. Channel tabs can now be rearranged from notebook top to left side. The Live365 plugin was fixed again, as was the Xiph.org cache service. Shorter Youtube homepage URLs are now presented.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2014-08-15T01:00:00+0000"
        },
        {
            "version": "2.1.2",
            "state": "stable",
            "scope": "minor feature",
            "changes": "Radio list retrieval from Radionomys renewed Shoutcast have been fixed. The Live365 plugin however was disabled. There's also support for iTunes Radio stations (via RoliSoft Radio Playlist API), and a new channel module \"iCast.io\" as seen in VLC. SurfMusic.de is now available in a localized English display. Shorter Youtube URLs are now used and the Wadsworth constant available. MyOggRadio.org API interaction was fixed. More online music services have been added in the links list. The new and slimmer search dialog offers scanning all channels or just current and doesn't overwrite categories anymore.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2014-07-31T01:00:00+0000"
        },
        {
            "version": "2.1.1",
            "state": "stable",
            "scope": "major feature",
            "changes": "YouTube and SurfMusik channels were added, MODarchive included, but Google/DMOZ removed. The Jamendo API now allows browsing genres and shows cover images. Internet-Radio extraction was fixed, and a custom caching API introduced for Xiph/ICEcast. The configuration dialog visualizes plugins and options more coherently now. A new logo was introduced, and many bugfixes applied.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2014-05-28T16:31:00+0000"
        },
        {
            "version": "2.1.0",
            "state": "stable",
            "scope": "major feature",
            "changes": "Now supports running on Python3 and Python2, and can utilize either PyGI with GTk3 or PyGtk for Gtk2. Shoutcast, DMOZ and Live365 channels were fixed. Jamendo only lists radio stations for now. Basic.ch and Shoutcast TV channels were removed. HTTP downloading now uses requests and urllib3. Only real JSON is generated for config files now. Debugging output now is colorized, and ListStore references have finally been fixed.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2014-04-28T02:13:00+0000"
        },
        {
            "version": "2.0.9",
            "state": "stable",
            "scope": "major bugfix",
            "changes": "Fixes for sys.path merging, Gtk.main_quit were applied. Stream editing now provides a [new] button. Transitioned glade UI to gtk.Builder, and made configuration window resizable, and stations lists are no longer sortable. Pixbuf typecasting has been fixed in the mygtk handler.",
            "download": "http://sourceforge.net/projects/streamtuner2/files/",
            "published": "2014-01-05T01:23:00+0000"
        }
    ]
}